---------------------------
--main.lua
--by滨州IT疯子
--------------------------
require "init" --初始化库
require "lib"--专用函数库

function 领取邮件()
  
	local m={
  {登陆界面,{'开始游戏'}},
  {广告界面,{'关闭'}},
  {弹窗界面,{'确定'}},
  {主界面,{'邮件','活动'}},
  {邮件界面,{'可领取邮件','快速领取','返回'}},
	{活动界面,{'领取按钮','竖排按钮','横排按钮','关闭'}},
	{修炼之路,{'积分兑换','关闭'}},
	{积分兑换,{'兑换','返回'}},
}
F运行(m)
end
function 冒险模式()
	local m={
		{活动界面,{'关闭'}},
		{主界面,{'冒险模式'}},
		{广告界面,{'关闭'}},
		{弹窗界面,{'确定'}},
		{冒险界面,{'陨落废都挑战'}},
		{挑战界面,{'下一步'}},
		{更换阵容界面,{'闯关'}},
	}
	F运行(m)
end
function main()
  
  F检查分辨率()
  --领取邮件()
	冒险模式()
end

main()